In [78]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [79]:
import lux

In [80]:
from google.colab import files
uploaded = files.upload()

Saving XGBoost.csv to XGBoost (2).csv

In [81]:
import io
df = pd.read_csv(io.BytesIO(uploaded['XGBoost.csv']))

In [82]:
df.head()

   Unnamed: 0      Suburb  ...             Regionname  Propertycount
0           1  Abbotsford  ...  Northern Metropolitan         4019.0
1           2  Abbotsford  ...  Northern Metropolitan         4019.0
2           4  Abbotsford  ...  Northern Metropolitan         4019.0
3           5  Abbotsford  ...  Northern Metropolitan         4019.0
4           6  Abbotsford  ...  Northern Metropolitan         4019.0

[5 rows x 22 columns]

In [83]:
df = df.drop(['Suburb', 'Address', 'Type', 'Method', 'SellerG', 'Date', 'Date', 'Postcode', 'BuildingArea', 'CouncilArea', 'Regionname'], axis=1)

In [84]:
df.head()

   Unnamed: 0  Rooms    Price  ...  Lattitude  Longtitude  Propertycount
0           1      2  1480000  ...   -37.7996    144.9984         4019.0
1           2      2  1035000  ...   -37.8079    144.9934         4019.0
2           4      3  1465000  ...   -37.8093    144.9944         4019.0
3           5      3   850000  ...   -37.7969    144.9969         4019.0
4           6      4  1600000  ...   -37.8072    144.9941         4019.0

[5 rows x 12 columns]

In [85]:
df = df.drop(['Car', 'Bedroom2', 'Lattitude', 'Longtitude', 'Propertycount'], axis=1)

In [86]:
df.head()

   Unnamed: 0  Rooms    Price  Distance  Bathroom  Landsize  YearBuilt
0           1      2  1480000       2.5       1.0     202.0        NaN
1           2      2  1035000       2.5       1.0     156.0     1900.0
2           4      3  1465000       2.5       2.0     134.0     1900.0
3           5      3   850000       2.5       2.0      94.0        NaN
4           6      4  1600000       2.5       1.0     120.0     2014.0

In [87]:
df.isnull().sum()

Unnamed: 0       0
Rooms            0
Price            0
Distance         1
Bathroom      3471
Landsize      4793
YearBuilt     9438
dtype: int64

In [88]:
df['YearBuilt'] = df['YearBuilt'].fillna(method ='bfill')

In [89]:
df.head()

   Unnamed: 0  Rooms    Price  Distance  Bathroom  Landsize  YearBuilt
0           1      2  1480000       2.5       1.0     202.0     1900.0
1           2      2  1035000       2.5       1.0     156.0     1900.0
2           4      3  1465000       2.5       2.0     134.0     1900.0
3           5      3   850000       2.5       2.0      94.0     2014.0
4           6      4  1600000       2.5       1.0     120.0     2014.0

In [90]:
df.isnull().sum()

Unnamed: 0       0
Rooms            0
Price            0
Distance         1
Bathroom      3471
Landsize      4793
YearBuilt        0
dtype: int64

In [91]:
df['Bathroom'] = df['Bathroom'].fillna(method ='pad')

In [92]:
df.head()

   Unnamed: 0  Rooms    Price  Distance  Bathroom  Landsize  YearBuilt
0           1      2  1480000       2.5       1.0     202.0     1900.0
1           2      2  1035000       2.5       1.0     156.0     1900.0
2           4      3  1465000       2.5       2.0     134.0     1900.0
3           5      3   850000       2.5       2.0      94.0     2014.0
4           6      4  1600000       2.5       1.0     120.0     2014.0

In [93]:
df.isnull().sum()

Unnamed: 0       0
Rooms            0
Price            0
Distance         1
Bathroom         0
Landsize      4793
YearBuilt        0
dtype: int64

In [94]:
df.shape

(18396, 7)

In [95]:
df.isnull().sum()

Unnamed: 0       0
Rooms            0
Price            0
Distance         1
Bathroom         0
Landsize      4793
YearBuilt        0
dtype: int64

In [96]:
df['Landsize'] = df['Landsize'].fillna(df['Landsize'].mean())

In [97]:
df.isnull().sum()

Unnamed: 0    0
Rooms         0
Price         0
Distance      1
Bathroom      0
Landsize      0
YearBuilt     0
dtype: int64

In [98]:
df.head()

   Unnamed: 0  Rooms    Price  Distance  Bathroom  Landsize  YearBuilt
0           1      2  1480000       2.5       1.0     202.0     1900.0
1           2      2  1035000       2.5       1.0     156.0     1900.0
2           4      3  1465000       2.5       2.0     134.0     1900.0
3           5      3   850000       2.5       2.0      94.0     2014.0
4           6      4  1600000       2.5       1.0     120.0     2014.0

In [99]:
year = 2021
df['Age'] = year

In [100]:
df.head()

   Unnamed: 0  Rooms    Price  Distance  Bathroom  Landsize  YearBuilt   Age
0           1      2  1480000       2.5       1.0     202.0     1900.0  2021
1           2      2  1035000       2.5       1.0     156.0     1900.0  2021
2           4      3  1465000       2.5       2.0     134.0     1900.0  2021
3           5      3   850000       2.5       2.0      94.0     2014.0  2021
4           6      4  1600000       2.5       1.0     120.0     2014.0  2021

In [101]:
df['Total_no_of_years'] = df['Age'] - df['YearBuilt']

In [102]:
df.head()

   Unnamed: 0  Rooms    Price  ...  YearBuilt   Age  Total_no_of_years
0           1      2  1480000  ...     1900.0  2021              121.0
1           2      2  1035000  ...     1900.0  2021              121.0
2           4      3  1465000  ...     1900.0  2021              121.0
3           5      3   850000  ...     2014.0  2021                7.0
4           6      4  1600000  ...     2014.0  2021                7.0

[5 rows x 9 columns]

In [103]:
df = df.drop(['YearBuilt', 'Age'], axis=1)

In [104]:
df.head()

   Unnamed: 0  Rooms    Price  Distance  Bathroom  Landsize  Total_no_of_years
0           1      2  1480000       2.5       1.0     202.0              121.0
1           2      2  1035000       2.5       1.0     156.0              121.0
2           4      3  1465000       2.5       2.0     134.0              121.0
3           5      3   850000       2.5       2.0      94.0                7.0
4           6      4  1600000       2.5       1.0     120.0                7.0

In [111]:
X = df[['Rooms', 'Distance', 'Bathroom', 'Landsize', 'Total_no_of_years']]
y = df['Price']

In [113]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size=0.2)

In [114]:
from xgboost import XGBRegressor
my_model = XGBRegressor()
my_model.fit(X_train, y_train)

[09:38:06] WARNING: /workspace/src/objective/regression_obj.cu:152: reg:linear is now deprecated in favor of reg:squarederror.

XGBRegressor(base_score=0.5, booster='gbtree', colsample_bylevel=1,
             colsample_bynode=1, colsample_bytree=1, gamma=0,
             importance_type='gain', learning_rate=0.1, max_delta_step=0,
             max_depth=3, min_child_weight=1, missing=None, n_estimators=100,
             n_jobs=1, nthread=None, objective='reg:linear', random_state=0,
             reg_alpha=0, reg_lambda=1, scale_pos_weight=1, seed=None,
             silent=None, subsample=1, verbosity=1)

In [116]:
from sklearn.metrics import mean_absolute_error
predictions = my_model.predict(X_test)
print("Mean Absolute Error: " + str(mean_absolute_error(predictions, y_test)))

Mean Absolute Error: 282405.6177012568

In [117]:
my_model = XGBRegressor(n_estimators=500)
my_model.fit(X_train, y_train)

[09:40:56] WARNING: /workspace/src/objective/regression_obj.cu:152: reg:linear is now deprecated in favor of reg:squarederror.

XGBRegressor(base_score=0.5, booster='gbtree', colsample_bylevel=1,
             colsample_bynode=1, colsample_bytree=1, gamma=0,
             importance_type='gain', learning_rate=0.1, max_delta_step=0,
             max_depth=3, min_child_weight=1, missing=None, n_estimators=500,
             n_jobs=1, nthread=None, objective='reg:linear', random_state=0,
             reg_alpha=0, reg_lambda=1, scale_pos_weight=1, seed=None,
             silent=None, subsample=1, verbosity=1)

In [118]:
my_model = XGBRegressor(n_estimators=500)
my_model.fit(X_train, y_train, 
             early_stopping_rounds=5, 
             eval_set=[(X_test, y_test)],
             verbose=False)

[09:42:17] WARNING: /workspace/src/objective/regression_obj.cu:152: reg:linear is now deprecated in favor of reg:squarederror.

XGBRegressor(base_score=0.5, booster='gbtree', colsample_bylevel=1,
             colsample_bynode=1, colsample_bytree=1, gamma=0,
             importance_type='gain', learning_rate=0.1, max_delta_step=0,
             max_depth=3, min_child_weight=1, missing=None, n_estimators=500,
             n_jobs=1, nthread=None, objective='reg:linear', random_state=0,
             reg_alpha=0, reg_lambda=1, scale_pos_weight=1, seed=None,
             silent=None, subsample=1, verbosity=1)

In [119]:
my_model = XGBRegressor(n_estimators=1000, learning_rate=0.05)
my_model.fit(X_train, y_train, 
             early_stopping_rounds=5, 
             eval_set=[(X_test, y_test)],
             verbose=False)

[09:42:37] WARNING: /workspace/src/objective/regression_obj.cu:152: reg:linear is now deprecated in favor of reg:squarederror.

XGBRegressor(base_score=0.5, booster='gbtree', colsample_bylevel=1,
             colsample_bynode=1, colsample_bytree=1, gamma=0,
             importance_type='gain', learning_rate=0.05, max_delta_step=0,
             max_depth=3, min_child_weight=1, missing=None, n_estimators=1000,
             n_jobs=1, nthread=None, objective='reg:linear', random_state=0,
             reg_alpha=0, reg_lambda=1, scale_pos_weight=1, seed=None,
             silent=None, subsample=1, verbosity=1)

In [120]:
my_model = XGBRegressor(n_estimators=1000, learning_rate=0.05, n_jobs=4)
my_model.fit(X_train, y_train, 
             early_stopping_rounds=5, 
             eval_set=[(X_test, y_test)],
             verbose=False)

[09:43:04] WARNING: /workspace/src/objective/regression_obj.cu:152: reg:linear is now deprecated in favor of reg:squarederror.

XGBRegressor(base_score=0.5, booster='gbtree', colsample_bylevel=1,
             colsample_bynode=1, colsample_bytree=1, gamma=0,
             importance_type='gain', learning_rate=0.05, max_delta_step=0,
             max_depth=3, min_child_weight=1, missing=None, n_estimators=1000,
             n_jobs=4, nthread=None, objective='reg:linear', random_state=0,
             reg_alpha=0, reg_lambda=1, scale_pos_weight=1, seed=None,
             silent=None, subsample=1, verbosity=1)